In [1]:
import numpy
numbers = [12, 45.7, 89, 23.5, 67, 91.2, 34, 56.3, 78]
print(numpy.mean(numbers))

55.18888888888889

In [2]:
import numpy as np

In [3]:
mean = 55.19 #of the list of numbers

In [4]:
print(numbers, mean)

[12, 45.7, 89, 23.5, 67, 91.2, 34, 56.3, 78] 55.19

In [5]:
print(np.mean(numbers))

55.18888888888889

In [6]:
abs_nums = np.abs(numbers)
print(abs_nums)
# getting absolute value of all numbers in numbers and save it to the variable abs_nums

[12.  45.7 89.  23.5 67.  91.2 34.  56.3 78. ]

In [7]:
# NOT a list; it is a numpy array
abs_nums

array([12. , 45.7, 89. , 23.5, 67. , 91.2, 34. , 56.3, 78. ])

In [8]:
print(type(abs_nums))

<class 'numpy.ndarray'>

In [9]:
# Version 1
numbers = [10, 2.3, -4, 20, 14, 1, 2, 0, -3, 1, -2, 2, 2, 65.4, 3, -23, 123, 43.1, 32, 57, 32]
numbers_sorted = np.sort(numbers)
print(numbers_sorted)

[-23.   -4.   -3.   -2.    0.    1.    1.    2.    2.    2.    2.3   3.
  10.   14.   20.   32.   32.   43.1  57.   65.4 123. ]

In [10]:
# Version 2
numbers.sort()
print(numbers)

[-23, -4, -3, -2, 0, 1, 1, 2, 2, 2, 2.3, 3, 10, 14, 20, 32, 32, 43.1, 57, 65.4, 123]

In [11]:
import pandas as pd

In [12]:
fruit_data = pd.DataFrame({'Product': ['Apples', 'Bananas', 'Lemons'],
             'Price': [1.50, 0.50, 1.99],
             'Quantity Sold': [26, 32, 17]})
# saving the dataframe to a variable called fruit_data
fruit_data

   Product  Price  Quantity Sold
0   Apples   1.50             26
1  Bananas   0.50             32
2   Lemons   1.99             17

In [13]:
print(fruit_data)

   Product  Price  Quantity Sold
0   Apples   1.50             26
1  Bananas   0.50             32
2   Lemons   1.99             17

In [14]:
grades_df = pd.read_csv("Student_Grades.csv")
grades_df

    number_courses  time_study   grade
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [15]:
grades_df.shape

(100, 3)

In [16]:
grades_df.describe()

       number_courses  time_study       grade
count      100.000000  100.000000  100.000000
mean         5.290000    4.077140   24.417690
std          1.799523    2.372914   14.326199
min          3.000000    0.096000    5.609000
25%          4.000000    2.058500   12.633000
50%          5.000000    4.022000   20.059500
75%          7.000000    6.179250   36.676250
max          8.000000    7.957000   55.299000

In [17]:
# Transpose the rows and columns with '.T'
#grades_df = grades_df.T
print(grades_df)

    number_courses  time_study   grade
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [18]:
# What are the maximum grades for this dataset?
print(grades_df.describe())
print(min(grades_df.grade))
print(max(grades_df.grade))
# Python is an OOP language which uses dot notation for previous data

       number_courses  time_study       grade
count      100.000000  100.000000  100.000000
mean         5.290000    4.077140   24.417690
std          1.799523    2.372914   14.326199
min          3.000000    0.096000    5.609000
25%          4.000000    2.058500   12.633000
50%          5.000000    4.022000   20.059500
75%          7.000000    6.179250   36.676250
max          8.000000    7.957000   55.299000
5.609
55.299

In [19]:
studied_less_than_5 = grades_df[grades_df.time_study < 5] #boolean until here... grades_df.grade > 50]
studied_less_than_5

    number_courses  time_study   grade
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
5                6       3.211  17.822
7                5       3.413  17.264
..             ...         ...     ...
91               8       2.730  19.564
94               8       3.919  24.451
95               6       3.561  19.128
96               3       0.301   5.609
98               7       0.309  12.027

[65 rows x 3 columns]

In [20]:
studied_less_than_5 = grades_df[(grades_df.time_study < 5) & (grades_df.grade > 50)]
studied_less_than_5
# it is empty

Empty DataFrame
Columns: [number_courses, time_study, grade]
Index: []

In [21]:
# What is the average of student who studied more than six hours
more_than_6 = grades_df[grades_df.time_study > 6]
#dataframe[clause]
more_than_6.grade.mean()

43.27396666666667

In [22]:
more_than_6.describe().T

,count,mean,std,min,25%,50%,75%,max
number_courses,30.0,5.833333,1.858500,3.000,4.00000,6.0000,7.000,8.000
time_study,30.0,6.965000,0.671996,6.049,6.34525,7.0585,7.579,7.957
grade,30.0,43.273967,7.628259,29.889,38.85550,41.7400,51.103,55.299

In [23]:
print(more_than_6['grade'])

3     53.018
4     55.299
6     29.889
9     30.862
10    42.036
17    38.490
18    50.986
21    35.939
33    39.965
35    43.978
37    46.453
38    41.358
39    51.142
50    40.602
53    36.653
54    53.158
56    53.359
57    51.583
58    31.236
59    51.343
74    39.952
76    36.746
78    49.544
80    54.321
82    44.099
85    39.957
89    40.024
93    42.426
97    41.444
99    32.357
Name: grade, dtype: float64

In [24]:
# first try
#std = grades_df.rank()
#std

In [25]:
# 1.
std_dev = grades_df['grade'].std()
grades_df['rank'] = grades_df['grade'].rank()
min_grade = grades_df['grade'].min()
max_grade = grades_df['grade'].max()
grade_range = max_grade - min_grade
grades_df['bell_curve_grades'] = 100 * (grades_df['grade'] - min_grade) / grade_range
print(f"Standard Deviation: {std_dev}")

Standard Deviation: 14.326198570757976

In [26]:
# 2.
passing_students = grades_df[grades_df['bell_curve_grades'] >= 70].shape[0]
print(f"Number of students passing (with curve): {passing_students}")

Number of students passing (with curve): 18